app/Cells/ArtikelTerkini.php

SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5
---
    public function render(): string
    {
        $model = new ArtikelModel();

        // Ambil 5 artikel terbaru
        $artikel = $model->orderBy('id', 'DESC')->limit(5)->findAll();