app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
---
    public function index()
    {
        // Fitur Pencarian untuk User
        $q = $this->request->getVar('q') ?? '';

        $data = [
            'title'   => 'Daftar Artikel',
            'q'       => $q,
            // Membatasi tampilan 6 artikel per halaman [cite: 22]
            'artikel' => $this->artikelModel->like('judul', $q)->paginate(6, 'artikel'),